# Pandas

* Jake VanderPlas. 2016. *Python Data Science Handbook: Essential Tools for Working with Data*. O'Reilly Media, Inc.
* Chapter 3 - Data Manipulation with Pandas
* https://github.com/jakevdp/PythonDataScienceHandbook

Pandas provides:

* Rich I/O Capabilities (read/write data from/to CSV, Excel, SQL, JSON, etc.)
* 1-dimensional (**Series**) and 2-dimensional tabular (**DataFrame**) data structures.
* Data flexibility (handles missing data, time series, and heterogeneous data types).
* Labeled Rows and columns for data alignment
* Flexible indexing, slicing, fancy indexing, and subsetting of large datasets.

In [100]:
import numpy as np
import pandas as pd
def pprint(*args, sep='\n', end='\n', userepr=True, align=False, breakline=False, indent='   '):
    "Evaluate and pretty print"
    if align :
        max_arg_len = max(map(len,args))
        txt2txt = lambda txt : ' '*(max_arg_len-len(txt)) + txt
        args = list(map(txt2txt, args))
    txt2txt = lambda txt : f'{repr(eval(txt))}' if userepr else f'{eval(txt)}'    
    output = map(txt2txt, args)
    txt2txt = lambda txt : f'{txt} = '    
    prefix = map(txt2txt, args)
    if breakline :
        po2txt = lambda p,o : (p+'\n'+o).replace('\n','\n'+indent)
    else:
        po2txt = lambda p,o : (p+o).replace('\n','\n'+' '*len(p))
    print(*map(po2txt, prefix, output), sep=sep, end=end)

pd.__version__

'2.2.3'

In [90]:
# type TAB to get the numpy namespace
#pd.

## Pandas Series

* One-dimensional array of indexed data
* Two key attributes:
   * `values` : NumPy array
   * `index` : an array-like object of type `pd.Index`

In [101]:
d = pd.Series([0.25, 0.5, 0.75, 1.0])
pprint('d', 'd.values', 'd.index', align=True)

       d = 0    0.25
           1    0.50
           2    0.75
           3    1.00
           dtype: float64
d.values = array([0.25, 0.5 , 0.75, 1.  ])
 d.index = RangeIndex(start=0, stop=4, step=1)

Series can be created from NumPy arrays:

In [4]:
d = pd.Series(np.linspace(0,4,6))
d

0    0.0
1    0.8
2    1.6
3    2.4
4    3.2
5    4.0
dtype: float64

A series can be indexed just like a NumPy array:

In [5]:
d = pd.Series(np.arange(10,15))
pprint('d[3]')  # simple index --> scalar
pprint('d[3:]', 'd[3:4]')  # slice --> series
pprint('d[[1,3,0]]', 'd[[1]]')  # fancy index --> series

d[3] = 13
d[3:] = 3    13
        4    14
        dtype: int64
d[3:4] = 3    13
         dtype: int64
d[[1,3,0]] = 1    11
             3    13
             0    10
             dtype: int64
d[[1]] = 1    11
         dtype: int64

But... Pandas Series can have an **explicit index**
   * If not provided, an **implicit int index** is used `[0,1,...,n-1]`

In [6]:
d = pd.Series(np.arange(10,15), index=["a","b","c","d","e"])
pprint('d')
# WARNING "treating keys as positions is deprecated"  --> use Series.iloc[pos]
#pprint('d[1]')
pprint('d["b"]')

d = a    10
    b    11
    c    12
    d    13
    e    14
    dtype: int64
d["b"] = 11

### Slicing - Case 1 - non-integer explicit index
   * Both non-integer (explicit) and integer (implicit) slices can be used.
   * non-integer slice &rarr; **label-based indexing** &rarr; $[from,to]$
   * integer slice &rarr; **position-based indexing** &rarr; $[from,to)$

<br>

In [7]:
d = pd.Series([100,101,102,103,104], index=["a","b","c","d","e"])
pprint('d')
pprint('d["a"]', 'd["c"]', 'd["a":"c"].values')   # explicit index
pprint('d[0:2].values')                           # implicit index

d = a    100
    b    101
    c    102
    d    103
    e    104
    dtype: int64
d["a"] = 100
d["c"] = 102
d["a":"c"].values = array([100, 101, 102])
d[0:2].values = array([100, 101])

### Slicing - Case 2 - integer explicit index
   * Slicing is <u>always referred to implicit indexes</u>.
   * integer slice &rarr; **position-based indexing** &rarr; $[from,to)$

<br>

In [8]:
d = pd.Series([100,101,102,103,104], index=[1,5,4,2,3])
pprint('d')
pprint('d[1]', 'd[3]')  # explicit index
pprint('d[1:3].values') # implicit index

d = 1    100
    5    101
    4    102
    2    103
    3    104
    dtype: int64
d[1] = 100
d[3] = 104
d[1:3].values = array([101, 102])

### Fancy Indexing
   * Label-based indexing
   * Using position-based indexing is deprecated 

<br>

In [9]:
d = pd.Series([100,101,102,103,104], index=["a","b","c","d","e"])
pprint('d[["a","b","c"]].values')   # implicit index
# WARNING "treating keys as positions is deprecated"  --> use Series.iloc[pos]
#pprint('d[[1,2,3]].values')   # implicit index

d = pd.Series([100,101,102,103,104], index=[1,5,4,2,3])
pprint('d[[1,2,3]].values')   # explicit index

d[["a","b","c"]].values = array([100, 101, 102])
d[[1,2,3]].values = array([100, 103, 104])

### Series and dictionaries
* Series are kind of specialized Python dictionaries $\{index_{typed \,\&\, ordered} \to value_{typed}\}$ 
* `pd.Series(dict)` &rarr; create a Series from a dictionary
* `pd.Series.to_dict()` &rarr; create a dictionary from a Series<br><br>

In [10]:
d1 = pd.Series([100,101,102], index=["a","b","c"])
x = d1.to_dict()
d2 = pd.Series(x)
pprint('d1','x','d2')

d1 = a    100
     b    101
     c    102
     dtype: int64
x = {'a': 100, 'b': 101, 'c': 102}
d2 = a    100
     b    101
     c    102
     dtype: int64

* `.keys()` &rarr; `.index` <br><br>

In [11]:
d = pd.Series([100,101,102,103,104], index=["a","b","c","d","e"])
pprint('type(d.index) == type(d.keys())')
pprint('d.index == d.keys()')
pprint('d.index is d.keys()')

type(d.index) == type(d.keys()) = True
d.index == d.keys() = array([ True,  True,  True,  True,  True])
d.index is d.keys() = True

 <br>
 
 * $\nexists\;\;$ `.values()`

* `.items()` &rarr; `zip` object of `(index,value)` <br><br>

In [12]:
d = pd.Series([100,101,102,103,104], index=["a","b","c","d","e"])
pprint('d.items()')
print(*d.items())

d.items() = <zip object at 0x7f100160e980>
('a', 100) ('b', 101) ('c', 102) ('d', 103) ('e', 104)

<br>

* `x in series` &rarr; checks if Series index contains `x`

In [13]:
d = pd.Series([100,101,102,103,104], index=["a","b","c","d","e"])
pprint('102 in d', '"xxx" in d')

102 in d = False
"xxx" in d = False

## Pandas DataFrame

* DataFrames are kind of specialized Python dictionaries $\{index_{typed \,\&\, ordered} \to series\}$ with a common row index
* Kind of *Series of Series* with a common row index
* * Three key attributes:
   * `values` : NumPy array
   * `index` and `columns`: array-like objects of type `pd.Index`

<br>

In [14]:
cities = ['California','Texas','Florida','New York']
population = pd.Series([39538223,29145505,21538187,20201249], index=cities)
area = pd.Series([423967, 695662, 170312, 141297], index=cities)
states = pd.DataFrame({'population':population, 'area':area})
states

            population    area
California    39538223  423967
Texas         29145505  695662
Florida       21538187  170312
New York      20201249  141297

* The `index` attribute (*row index*) and `columns` attribute (*column index*) are of type `pd.Index`
* The `values` attribute (of type `np.ndarray`) contains the data

<br>

In [15]:
states.index

Index(['California', 'Texas', 'Florida', 'New York'], dtype='object')

<br>

In [16]:
states.columns

Index(['population', 'area'], dtype='object')

<br>

In [17]:
states.values

array([[39538223,   423967],
       [29145505,   695662],
       [21538187,   170312],
       [20201249,   141297]])

A DataFrame can be constructed from a single series:<br><br>

In [18]:
cities = ['California','Texas','Florida','New York']
population = pd.Series([39538223,29145505,21538187,20201249], index=cities)
states = pd.DataFrame(population, columns=['population'])
states

            population
California    39538223
Texas         29145505
Florida       21538187
New York      20201249

A DataFrame can be constructed from a dictionary of Series:<br><br>

In [19]:
cities = ['California','Texas','Florida','New York']
population = pd.Series([39538223,29145505,21538187,20201249], index=cities)
area = pd.Series([423967, 695662, 170312, 141297], index=cities)
states = pd.DataFrame({'population':population, 'area':area})
states

            population    area
California    39538223  423967
Texas         29145505  695662
Florida       21538187  170312
New York      20201249  141297

A DataFrame can be constructed from list of dictionaries:<br><br>

In [20]:
data = [
    {'population':39538223, 'area':423967},
    {'population':29145505, 'area':695662},
    {'population':21538187, 'area':170312},
    {'population':20201249, 'area':141297}
]
states = pd.DataFrame(data, index=["California","Texas","Florida","New York"])
states

            population    area
California    39538223  423967
Texas         29145505  695662
Florida       21538187  170312
New York      20201249  141297

A DataFrame can be constructed from a two-dimensional NumPy array:<br><br>

In [21]:
data = np.array([[39538223,   423967],
          [29145505,   695662],
          [21538187,   170312],
          [20201249,   141297]])
states = pd.DataFrame(data,
                      columns=["population","area"],
                      index=["California","Texas","Florida","New York"])
states

            population    area
California    39538223  423967
Texas         29145505  695662
Florida       21538187  170312
New York      20201249  141297

A DataFrame can integrate indexes in different orders<br><br>

In [22]:
cities1 = ['California','Texas','Florida','New York']
population = pd.Series([39538223,29145505,21538187,20201249], index=cities1)
cities2 = ['Texas','Florida','New York','California']
area = pd.Series([695662, 170312, 141297, 423967], index=cities2)
states = pd.DataFrame({'population':population, 'area':area})
states

            population    area
California    39538223  423967
Florida       21538187  170312
New York      20201249  141297
Texas         29145505  695662

A DataFrame can integrate indexes with different values
* *Missing* values are filled with `NaN`s <br><br>

In [23]:
cities1 = ['California','Texas','Florida']
population = pd.Series([39538223,29145505,21538187], index=cities1)
cities2 = ['Texas','Florida','New York']
area = pd.Series([695662, 170312, 141297], index=cities2)
states = pd.DataFrame({'population':population, 'area':area})
states

            population      area
California  39538223.0       NaN
Florida     21538187.0  170312.0
New York           NaN  141297.0
Texas       29145505.0  695662.0

## Pandas Index
* Kind of Immutable NumPy array
* Many NumPy attributes, indexable, sliceable, etc. <br><br>

In [144]:
ind = pd.Index(['California', 'Texas', 'Florida'])
pprint('ind', 'ind[1]', 'ind[:2]', 'ind[[2,0,1]]', align=True, end='\n\n')
pprint('ind.size', 'ind.shape', 'ind.ndim', 'ind.dtype', align=True)

         ind = Index(['California', 'Texas', 'Florida'], dtype='object')
      ind[1] = 'Texas'
     ind[:2] = Index(['California', 'Texas'], dtype='object')
ind[[2,0,1]] = Index(['Florida', 'California', 'Texas'], dtype='object')

 ind.size = 3
ind.shape = (3,)
 ind.ndim = 1
ind.dtype = dtype('O')

In [145]:
ind = pd.Index([200, 1000, 300])
pprint('ind', 'ind[1]', 'ind[:2]', 'ind[[2,0,1]]', align=True, end='\n\n')
pprint('ind.size', 'ind.shape', 'ind.ndim', 'ind.dtype', align=True)

         ind = Index([200, 1000, 300], dtype='int64')
      ind[1] = 1000
     ind[:2] = Index([200, 1000], dtype='int64')
ind[[2,0,1]] = Index([300, 200, 1000], dtype='int64')

 ind.size = 3
ind.shape = (3,)
 ind.ndim = 1
ind.dtype = dtype('int64')

`pd.Index` follows many of the conventions of Python's `set`

* `idx1.union(idx2)` &rarr; combines elements from both Indexes
* `idx1.intersection(idx2)` &rarr; elements that are common to both Indexes
* `idx1.difference(idx2)` &rarr; elements in `idx1` that are not in `idx2`
* `idx1.symmetric_difference(idx2)` &rarr; elements in either, but not in both
* `idx1.equals(idx2)` &rarr; checks if they contain the same elements in the same order

<br>

In [146]:
idx1 = pd.Index([1,2,3,4,5])
idx2 = pd.Index([4,5,6,7])
pprint('idx1.union(idx2)', 'idx1.intersection(idx2)',
       'idx1.difference(idx2)', 'idx1.symmetric_difference(idx2)',
       'idx1.equals(idx2)', align=True)

               idx1.union(idx2) = Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')
        idx1.intersection(idx2) = Index([4, 5], dtype='int64')
          idx1.difference(idx2) = Index([1, 2, 3], dtype='int64')
idx1.symmetric_difference(idx2) = Index([1, 2, 3, 6, 7], dtype='int64')
              idx1.equals(idx2) = False

## Indexing and Selection

In [147]:
cities = ['California', 'Texas', 'Florida', 'New York', 'Pennsylvania']
area = pd.Series([423967, 695662, 170312, 141297, 119280], index=cities)
population = pd.Series([39538223, 29145505, 21538187, 20201249, 13002700], index=cities)
gdp = pd.Series([3.9, 2.7, 1.3, 1.8, 1.0], index=cities) # Gross Domestic Product 
df = pd.DataFrame({'area':area, 'population':population, 'GDP':gdp})
df

                area  population  GDP
California    423967    39538223  3.9
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
New York      141297    20201249  1.8
Pennsylvania  119280    13002700  1.0

* Simple Indexing &rarr; column selection (**Series**)

In [148]:
df['area']
# KeyError: 0
#df[0]

California      423967
Texas           695662
Florida         170312
New York        141297
Pennsylvania    119280
Name: area, dtype: int64

* Fancy Indexing &rarr; columns selection (**DataFrame**)

In [149]:
df[['GDP','area']]

              GDP    area
California    3.9  423967
Texas         2.7  695662
Florida       1.3  170312
New York      1.8  141297
Pennsylvania  1.0  119280

In [150]:
df[['area']]

                area
California    423967
Texas         695662
Florida       170312
New York      141297
Pennsylvania  119280

* Slicing &rarr; rows selection (**DataFrame**)

In [151]:
df[:2]

              area  population  GDP
California  423967    39538223  3.9
Texas       695662    29145505  2.7

In [152]:
df[1:2]

         area  population  GDP
Texas  695662    29145505  2.7

In [153]:
df[2:2]

Empty DataFrame
Columns: [area, population, GDP]
Index: []

### Combining columns & rows selection
* columns are selected with fancy indexes
* rows are selected with (position) slicing

In [154]:
df[['area','population']][:3]

              area  population
California  423967    39538223
Texas       695662    29145505
Florida     170312    21538187

In [155]:
df[:3][['area','population']]

              area  population
California  423967    39538223
Texas       695662    29145505
Florida     170312    21538187

### Accessing the data through `df.values`
   * `df.values` &rarr; homogeneous NumPy array
   * Series values dtypes can be promoted

In [156]:
pprint('df.values')
pprint('df.values.dtype', 'df["area"].dtype',
       'df["population"].dtype', 'df["GDP"].dtype', align=True)

df.values = array([[4.2396700e+05, 3.9538223e+07, 3.9000000e+00],
                   [6.9566200e+05, 2.9145505e+07, 2.7000000e+00],
                   [1.7031200e+05, 2.1538187e+07, 1.3000000e+00],
                   [1.4129700e+05, 2.0201249e+07, 1.8000000e+00],
                   [1.1928000e+05, 1.3002700e+07, 1.0000000e+00]])
       df.values.dtype = dtype('float64')
      df["area"].dtype = dtype('int64')
df["population"].dtype = dtype('int64')
       df["GDP"].dtype = dtype('float64')

### Masking with comparison operator
* Let `op` be an operator
* `Series op value` &rarr; broadcasted operation &rarr; Series
* `DataFrame op value` &rarr; broadcasted operation &rarr; DataFrame

In [157]:
df * 10

                 area  population   GDP
California    4239670   395382230  39.0
Texas         6956620   291455050  27.0
Florida       1703120   215381870  13.0
New York      1412970   202012490  18.0
Pennsylvania  1192800   130027000  10.0

In [158]:
df > 2

              area  population    GDP
California    True        True   True
Texas         True        True   True
Florida       True        True  False
New York      True        True  False
Pennsylvania  True        True  False

In [159]:
df['GDP'] > 2

California       True
Texas            True
Florida         False
New York        False
Pennsylvania    False
Name: GDP, dtype: bool

Boolean Series/DataFrame can be used as indexes
* Boolean Series &rarr; select rows
* Boolean DataFrame &rarr; select elements (and fill with `NaN`)

In [160]:
df[df['GDP'] > 2]

              area  population  GDP
California  423967    39538223  3.9
Texas       695662    29145505  2.7

In [161]:
df[df > 2]

                area  population  GDP
California    423967    39538223  3.9
Texas         695662    29145505  2.7
Florida       170312    21538187  NaN
New York      141297    20201249  NaN
Pennsylvania  119280    13002700  NaN

Find the area for cities with `GDP>1` and `population<30000000`:

In [162]:
df[df['GDP'] > 1]

              area  population  GDP
California  423967    39538223  3.9
Texas       695662    29145505  2.7
Florida     170312    21538187  1.3
New York    141297    20201249  1.8

In [163]:
df[(df['GDP']>1) & (df['population']<30000000)]

            area  population  GDP
Texas     695662    29145505  2.7
Florida   170312    21538187  1.3
New York  141297    20201249  1.8

In [164]:
df[(df['GDP']>1) & (df['population']<30000000)]['area']

Texas       695662
Florida     170312
New York    141297
Name: area, dtype: int64

### Indexers: `.loc` and `.iloc`
* `.loc` &rarr; explicit indexing (and slicing) 
* `.iloc` &rarr; implicit indexing (and slicing)
* NumPy style indexing
   * `.loc[i]` &rarr; row `i` 
   * `.loc[i,j]` &rarr; row `i` , column `j` 
   * Simple Indexing, Fancy Indexing and Slicing

In [165]:
df

                area  population  GDP
California    423967    39538223  3.9
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
New York      141297    20201249  1.8
Pennsylvania  119280    13002700  1.0

In [166]:
df.loc['Florida']

area            170312.0
population    21538187.0
GDP                  1.3
Name: Florida, dtype: float64

In [167]:
df.loc[['Florida','Texas']]

           area  population  GDP
Florida  170312    21538187  1.3
Texas    695662    29145505  2.7

In [168]:
df.loc[:'Florida']

              area  population  GDP
California  423967    39538223  3.9
Texas       695662    29145505  2.7
Florida     170312    21538187  1.3

In [169]:
df.iloc[2]

area            170312.0
population    21538187.0
GDP                  1.3
Name: Florida, dtype: float64

In [170]:
df.iloc[[2,1]]

           area  population  GDP
Florida  170312    21538187  1.3
Texas    695662    29145505  2.7

In [171]:
df.iloc[:3]

              area  population  GDP
California  423967    39538223  3.9
Texas       695662    29145505  2.7
Florida     170312    21538187  1.3

In [172]:
df.loc['Florida','population']

21538187

In [173]:
df.loc[['California','Florida'],'population']

California    39538223
Florida       21538187
Name: population, dtype: int64

In [174]:
df.loc[['California','Florida'],:]

              area  population  GDP
California  423967    39538223  3.9
Florida     170312    21538187  1.3

Using `.iloc` is similar to using `df.values`, but maintaining the DataFrame structure (vs. homogeneous NumPy array)

In [175]:
df.iloc[:2,[0,2]]

              area  GDP
California  423967  3.9
Texas       695662  2.7

In [176]:
df.values[:2,[0,2]] , df.values[:2,[0,2]].dtype

(array([[4.23967e+05, 3.90000e+00],
        [6.95662e+05, 2.70000e+00]]),
 dtype('float64'))

## Modifying DataFrames Through Indexing
* The indexing can be used to modify a DataFrame
   * Modify values
   * Add/remove columns
   * Add/remove rows

### Modifying DataFrame values

* Simple indexing &rarr; column assignment

In [177]:
df2 = df.copy()
df2['area'] = 0
df2

              area  population  GDP
California       0    39538223  3.9
Texas            0    29145505  2.7
Florida          0    21538187  1.3
New York         0    20201249  1.8
Pennsylvania     0    13002700  1.0

* Fancy Indexing &rarr; coumns assignment

In [178]:
df2 = df.copy()
df2[['area','GDP']] = 0
df2

              area  population  GDP
California       0    39538223    0
Texas            0    29145505    0
Florida          0    21538187    0
New York         0    20201249    0
Pennsylvania     0    13002700    0

* Slicing &rarr; rows assignment

In [179]:
df2 = df.copy()
df2[:2] = 0
df2

                area  population  GDP
California         0           0  0.0
Texas              0           0  0.0
Florida       170312    21538187  1.3
New York      141297    20201249  1.8
Pennsylvania  119280    13002700  1.0

* Asigning to `df.values[i,j]` does not touch the dataframe

In [180]:
df2 = df.copy()
df2.values[:2,:2] = 0
df2

                area  population  GDP
California    423967    39538223  3.9
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
New York      141297    20201249  1.8
Pennsylvania  119280    13002700  1.0

* Series masking (index is a boolean Series) &rarr; rows asignment

In [181]:
df2 = df.copy()
pprint('df2["GDP"]>2')
df2[df2['GDP']>2] = 0
df2

df2["GDP"]>2 = California       True
               Texas            True
               Florida         False
               New York        False
               Pennsylvania    False
               Name: GDP, dtype: bool

                area  population  GDP
California         0           0  0.0
Texas              0           0  0.0
Florida       170312    21538187  1.3
New York      141297    20201249  1.8
Pennsylvania  119280    13002700  1.0

* DataFrame masking (index is a boolean DataFrame) &rarr; *elements* asignment

In [182]:
df2 = df.copy()
pprint('df2>2')
df2[df2>2] = 0
df2

df2>2 =               area  population    GDP
        California    True        True   True
        Texas         True        True   True
        Florida       True        True  False
        New York      True        True  False
        Pennsylvania  True        True  False

              area  population  GDP
California       0           0  0.0
Texas            0           0  0.0
Florida          0           0  1.3
New York         0           0  1.8
Pennsylvania     0           0  1.0

* `.loc` and `.iloc` &rarr; *subset* asignment

In [183]:
df2 = df.copy()
df2.loc[['California','New York'],'population':] = 0
df2

                area  population  GDP
California    423967           0  0.0
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
New York      141297           0  0.0
Pennsylvania  119280    13002700  1.0

In [184]:
df2 = df.copy()
df2.iloc[[0,3],1:] = 0
df2

                area  population  GDP
California    423967           0  0.0
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
New York      141297           0  0.0
Pennsylvania  119280    13002700  1.0

### Adding/Removing columns
   * **Add**: `df[new_index] = value`
   * **Remove**: `del df[index]` or `df.drop(index, axis=1, inplace=True)`

In [185]:
# add column 'density'
df2 = df.copy()
df2['density'] = df2['population'] / df2['area']
df2

                area  population  GDP     density
California    423967    39538223  3.9   93.257784
Texas         695662    29145505  2.7   41.896072
Florida       170312    21538187  1.3  126.463121
New York      141297    20201249  1.8  142.970120
Pennsylvania  119280    13002700  1.0  109.009893

In [186]:
# remove column 'population'
df2 = df.copy()
del df2['population']
df2

                area  GDP
California    423967  3.9
Texas         695662  2.7
Florida       170312  1.3
New York      141297  1.8
Pennsylvania  119280  1.0

In [187]:
# remove column 'population'
df2 = df.copy()
df2.drop('population', axis=1, inplace=True)
df2

                area  GDP
California    423967  3.9
Texas         695662  2.7
Florida       170312  1.3
New York      141297  1.8
Pennsylvania  119280  1.0

In [188]:
# remove columns ['area','population']
df2 = df.copy()
df2.drop(['area','population'], axis=1, inplace=True)
df2

              GDP
California    3.9
Texas         2.7
Florida       1.3
New York      1.8
Pennsylvania  1.0

### Adding/Removing rows
   * **Add**: `df.loc[new_index] = value` (WARNING &rarr; homogeneous DataFrame)
   * **Remove**: `df.drop(index, axis=0, inplace=True)`

In [189]:
# add row 'chicago'
df2 = df.copy()
df2.loc['Chicago'] = [111111,22222222,2.0]
df2

                  area  population  GDP
California    423967.0  39538223.0  3.9
Texas         695662.0  29145505.0  2.7
Florida       170312.0  21538187.0  1.3
New York      141297.0  20201249.0  1.8
Pennsylvania  119280.0  13002700.0  1.0
Chicago       111111.0  22222222.0  2.0

In [190]:
# remove row 'New York'
df2 = df.copy()
df2.drop('New York', axis=0, inplace=True)
df2

                area  population  GDP
California    423967    39538223  3.9
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
Pennsylvania  119280    13002700  1.0

In [191]:
# remove rows ['California','New York']
df2 = df.copy()
df2.drop(['California','New York'], axis=0, inplace=True)
df2

                area  population  GDP
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
Pennsylvania  119280    13002700  1.0

## Operating on Data
   * Arithmetic operators and NumPy functions can be applied to Series/DataFrames
   * Indexes are preserved
   * Binary operations/functions align the indexses
      * Can manage incomplete data inserting `NaN`s
   * DataFrame and Series operation have broadcasting propperty

### Index Preservation

In [192]:
df

                area  population  GDP
California    423967    39538223  3.9
Texas         695662    29145505  2.7
Florida       170312    21538187  1.3
New York      141297    20201249  1.8
Pennsylvania  119280    13002700  1.0

In [193]:
df * 10

                 area  population   GDP
California    4239670   395382230  39.0
Texas         6956620   291455050  27.0
Florida       1703120   215381870  13.0
New York      1412970   202012490  18.0
Pennsylvania  1192800   130027000  10.0

In [194]:
np.log(df[['area','population']])

                   area  population
California    12.957411   17.492778
Texas         13.452619   17.187811
Florida       12.045387   16.885338
New York      11.858619   16.821255
Pennsylvania  11.689229   16.380668

Python operators have their equivalent Pandas object methods:

| Python operator | Pandas method(s)                |
|-----------------|---------------------------------|
| `+`             | `add`                           |
| `-`             | `sub`, `subtract`               |
| `*`             | `mul`, `multiply`               |
| `/`             | `truediv`, `div`, `divide`      |
| `//`            | `floordiv`                      |
| `%`             | `mod`                           |
| `**`            | `pow`                           |

### Index Alignment

In [195]:
x = pd.Series({'A': 10,'B': 20})
y = pd.Series({'B': 4, 'A': 5})
x / y

A    2.0
B    5.0
dtype: float64

In [196]:
x = pd.Series({'A': 10,'B': 20, 'C':30})
y = pd.Series({'B': 4, 'C': 5, 'D':3})
x / y

A    NaN
B    5.0
C    6.0
D    NaN
dtype: float64

In [197]:
df1 = pd.DataFrame({
    'first':pd.Series([1,2],index=["A","B"]),
    'second':pd.Series([1,2],index=["A","B"])})
df2 = pd.DataFrame({
    'first':pd.Series([3,2],index=["A","C"]),
    'second':pd.Series([2,4],index=["A","C"])})

In [198]:
df1

   first  second
A      1       1
B      2       2

In [199]:
df2

   first  second
A      3       2
C      2       4

In [200]:
df1 + df2

   first  second
A    4.0     3.0
B    NaN     NaN
C    NaN     NaN

Pandas arithmetic functions have a `fill_value` parameter to be used in place of missing entries:

In [201]:
df1.add(df2)

   first  second
A    4.0     3.0
B    NaN     NaN
C    NaN     NaN

In [202]:
df1.add(df2, fill_value=0)

   first  second
A    4.0     3.0
B    2.0     2.0
C    2.0     4.0

In [203]:
df1.loc['C']=0
df1

   first  second
A      1       1
B      2       2
C      0       0

In [204]:
df2.loc['B']=0
df2

   first  second
A      3       2
C      2       4
B      0       0

In [205]:
df1 + df2

   first  second
A      4       3
B      2       2
C      2       4

### Operations Between DataFrames and Series
* Broadcasting, *similar* to NumPy
   * Limitted to row-wise

In [206]:
ints = np.random.randint(0,10,(3,4))
df = pd.DataFrame(ints, columns=['A','B','C','D'], index=['x','y','z'])
df

   A  B  C  D
x  5  8  4  7
y  6  6  9  5
z  6  5  7  5

In [207]:
df

   A  B  C  D
x  5  8  4  7
y  6  6  9  5
z  6  5  7  5

In [208]:
df - df.loc['x']

   A  B  C  D
x  0  0  0  0
y  1 -2  5 -2
z  1 -3  3 -2

In [209]:
df.sub(df.loc['x'], axis=1)

   A  B  C  D
x  0  0  0  0
y  1 -2  5 -2
z  1 -3  3 -2

In [210]:
df

   A  B  C  D
x  5  8  4  7
y  6  6  9  5
z  6  5  7  5

In [211]:
# Broadcasting rules...
df - df['A']

    A   B   C   D   x   y   z
x NaN NaN NaN NaN NaN NaN NaN
y NaN NaN NaN NaN NaN NaN NaN
z NaN NaN NaN NaN NaN NaN NaN

In [212]:
df.sub(df['A'], axis=0)

   A  B  C  D
x  0  3 -1  2
y  0  0  3 -1
z  0 -1  1 -1

`pd.DataFrame(df['A'])` is a single column dataframe, but there is no broacasting between dataframes...

In [213]:
pd.DataFrame(df['A'])

   A
x  5
y  6
z  6

In [214]:
# Broadcasting rules...
df - pd.DataFrame(df['A'])

   A   B   C   D
x  0 NaN NaN NaN
y  0 NaN NaN NaN
z  0 NaN NaN NaN

## Handling Missing Data
Pandas use *Sentinel Values* to handle not available (NA) values:
* `None`, `np.nan` and `pd.NA`
    * Integer data: `pd.NA`
    * Floating point data: `np.nan` and `pd.NA`
    * General object data: `None`, `np.nan` and `pd.NA`
* By default, in numeric data, `None` &rarr; `np.nan` (floating point) 
<br>

In [217]:
s = pd.Series([None,2,3])
pprint('s', 's[0]', 'type(s[0])', align=True)

         s = 0    NaN
             1    2.0
             2    3.0
             dtype: float64
      s[0] = nan
type(s[0]) = <class 'numpy.float64'>

In [218]:
s = pd.Series([np.nan,2,3])
pprint('s', 's[0]', 'type(s[0])', align=True)

         s = 0    NaN
             1    2.0
             2    3.0
             dtype: float64
      s[0] = nan
type(s[0]) = <class 'numpy.float64'>

In [219]:
s = pd.Series([pd.NA,2,3])
pprint('s', 's[0]', 'type(s[0])', align=True)

         s = 0    <NA>
             1       2
             2       3
             dtype: object
      s[0] = <NA>
type(s[0]) = <class 'pandas._libs.missing.NAType'>

In [220]:
s = pd.Series([None,2,3], dtype='Int64')
pprint('s', 's[0]', 'type(s[0])', align=True)

         s = 0    <NA>
             1       2
             2       3
             dtype: Int64
      s[0] = <NA>
type(s[0]) = <class 'pandas._libs.missing.NAType'>

In [224]:
s = pd.Series([np.nan,2,3], dtype='Int64')
pprint('s', 's[0]', 'type(s[0])', align=True)

         s = 0    <NA>
             1       2
             2       3
             dtype: Int64
      s[0] = <NA>
type(s[0]) = <class 'pandas._libs.missing.NAType'>

In [225]:
s = pd.Series([None,"a",123])
pprint('s')

s = 0    None
    1       a
    2     123
    dtype: object

In [226]:
s = pd.Series([np.nan,"a",123])
pprint('s')

s = 0    NaN
    1      a
    2    123
    dtype: object

In [227]:
s = pd.Series([pd.NA,"a",123])
pprint('s')

s = 0    <NA>
    1       a
    2     123
    dtype: object

Table of upcasting conventions in Pandas when NA values are introduced:

|Typeclass     | Conversion when storing NAs | NA sentinel value      |
|--------------|-----------------------------|------------------------|
| ``floating`` | No change                   | ``np.nan``             |
| ``object``   | No change                   | ``None`` or ``np.nan`` |
| ``integer``  | Cast to ``float64``         | ``np.nan``             |
| ``boolean``  | Cast to ``object``          | ``None`` or ``np.nan`` |

### Ignoring Null values
* Most Numpy functions are not `nan`-aware (generate `nan`)
   * `nan`-aware NumPy functions (ignore `nan`s):
      * `np.nansum`
      * `np.nanmin`
      * `np.nanmax`
   * NumPy does not handle `pd.NA` &rarr; **ERROR** 
* Pandas functions are `NaN` and `NA` aware (ignore `nan`s)

<br>

In [231]:
s = pd.Series([1,2,None,3,4])
pprint('s.values',
       's.values.sum()', 's.values.min()', 's.values.max()',
       'np.sum(s.values)', 'np.min(s.values)', 'np.max(s.values)',
       'np.nansum(s.values)', 'np.nanmin(s.values)', 'np.nanmax(s.values)',
       's.sum()', 's.min()', 's.max()', align=True)

           s.values = array([ 1.,  2., nan,  3.,  4.])
     s.values.sum() = nan
     s.values.min() = nan
     s.values.max() = nan
   np.sum(s.values) = nan
   np.min(s.values) = nan
   np.max(s.values) = nan
np.nansum(s.values) = 10.0
np.nanmin(s.values) = 1.0
np.nanmax(s.values) = 4.0
            s.sum() = 10.0
            s.min() = 1.0
            s.max() = 4.0

In [236]:
s = pd.Series([1,2,pd.NA,3,4])
pprint('s.values',
       's.sum()', 's.min()', 's.max()', align=True)
# ERROR!
#pprint('s.values.sum()', 's.values.min()', 's.values.max()',
#       'np.sum(s.values)', 'np.min(s.values)', 'np.max(s.values)',
#       'np.nansum(s.values)', 'np.nanmin(s.values)', 'np.nanmax(s.values)')

s.values = array([1, 2, <NA>, 3, 4], dtype=object)
 s.sum() = 10
 s.min() = 1
 s.max() = 4

### Detecting Null values

* `isnull` &rarr; boolean mask (`True`/`False`) where Null values
* `notnull` &rarr; opposite of `isnull`

<br>

In [244]:
s = pd.Series([1,2,None,3,4])
pprint('s.isnull()', 's.notnull()', sep="\n\n", align=True)

 s.isnull() = 0    False
              1    False
              2     True
              3    False
              4    False
              dtype: bool

s.notnull() = 0     True
              1     True
              2    False
              3     True
              4     True
              dtype: bool

In [103]:
s[s.notnull()]

0    1.0
1    2.0
3    3.0
4    4.0
dtype: float64

### Dropping Null values

* `dropna` &rarr; copy with the null values removed
   * Series: remove Null values
   * DataFrame: remove rows/columns containing Null values
* `inplace` parameter: bool, default False
   * If True, remone/fill in-place. Note: this will modify any other views on this object (e.g., a no-copy slice for a column in a DataFrame).

<br>

In [251]:
s = pd.Series([1,2,None,3,4])
s.dropna()

0    1.0
1    2.0
3    3.0
4    4.0
dtype: float64

In [252]:
pprint('s',end='\n\n')
s.dropna(inplace=True) 
pprint('s')

s = 0    1.0
    1    2.0
    2    NaN
    3    3.0
    4    4.0
    dtype: float64

s = 0    1.0
    1    2.0
    3    3.0
    4    4.0
    dtype: float64

In [260]:
a = np.arange(15,dtype='float64').reshape(3,5)
a[(0,2,2),(3,0,2)] = np.nan
df = pd.DataFrame(a)
df

     0     1    2     3     4
0  0.0   1.0  2.0   NaN   4.0
1  5.0   6.0  7.0   8.0   9.0
2  NaN  11.0  NaN  13.0  14.0

In [261]:
df.dropna() # df.dropna(axis=0)

     0    1    2    3    4
1  5.0  6.0  7.0  8.0  9.0

In [262]:
df.dropna(axis=1)

      1     4
0   1.0   4.0
1   6.0   9.0
2  11.0  14.0

### Filling Null values

* `fillna` &rarr; copy with the null values replaced
* `inplace` parameter: bool, default False
   * If True, remone/fill in-place. Note: this will modify any other views on this object (e.g., a no-copy slice for a column in a DataFrame).
* **DEPRECATED** `method` parameter: {`bfill`, `ffill`, None}, default None
   * `ffill` &rarr; *forward fill*,  propagate the previous value forward
   * `bfill` &rarr; *back fill*,  propagate the next values backward
* use `data.ffill()` and `data.bfill()` instead
   * `axis` parameter: axis along which forward/back fill

<br>

In [288]:
s = pd.Series([1, None, 2, None, 3], index=list('abcde'), dtype='Int64')
pprint('s', 's.fillna(0)', 's.ffill()', 's.bfill()', align=True)

          s = a       1
              b    <NA>
              c       2
              d    <NA>
              e       3
              dtype: Int64
s.fillna(0) = a    1
              b    0
              c    2
              d    0
              e    3
              dtype: Int64
  s.ffill() = a    1
              b    1
              c    2
              d    2
              e    3
              dtype: Int64
  s.bfill() = a    1
              b    2
              c    2
              d    3
              e    3
              dtype: Int64

In [289]:
a = np.arange(15,dtype='float64').reshape(3,5)
a[(0,2,2),(3,0,2)] = np.nan
df = pd.DataFrame(a)
df

     0     1    2     3     4
0  0.0   1.0  2.0   NaN   4.0
1  5.0   6.0  7.0   8.0   9.0
2  NaN  11.0  NaN  13.0  14.0

In [290]:
df.fillna(0)

     0     1    2     3     4
0  0.0   1.0  2.0   0.0   4.0
1  5.0   6.0  7.0   8.0   9.0
2  0.0  11.0  0.0  13.0  14.0

In [293]:
df

     0     1    2     3     4
0  0.0   1.0  2.0   NaN   4.0
1  5.0   6.0  7.0   8.0   9.0
2  NaN  11.0  NaN  13.0  14.0

In [295]:
df.ffill() # default axis=0

     0     1    2     3     4
0  0.0   1.0  2.0   NaN   4.0
1  5.0   6.0  7.0   8.0   9.0
2  5.0  11.0  7.0  13.0  14.0

In [292]:
df.ffill(axis=1)

     0     1     2     3     4
0  0.0   1.0   2.0   2.0   4.0
1  5.0   6.0   7.0   8.0   9.0
2  NaN  11.0  11.0  13.0  14.0

In [294]:
df

     0     1    2     3     4
0  0.0   1.0  2.0   NaN   4.0
1  5.0   6.0  7.0   8.0   9.0
2  NaN  11.0  NaN  13.0  14.0

In [296]:
df.bfill() # default axis=0

     0     1    2     3     4
0  0.0   1.0  2.0   8.0   4.0
1  5.0   6.0  7.0   8.0   9.0
2  NaN  11.0  NaN  13.0  14.0

In [297]:
df.bfill(axis=1)

      0     1     2     3     4
0   0.0   1.0   2.0   4.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  11.0  11.0  13.0  13.0  14.0

## Hierarchical Indexing???

## Combining Datasets: Concat and Append